// Conjunto de caracteres de mapeamento de acentos
const accentMapping = {
	'É': "E", 'é': "e", 'À': "A", 'à': "a", 'Ç': "C", 'ç': "c", 'Ñ': "N", 'ñ': "n", 'Á': 'A', 'á': 'a',
	'Ä': "A", 'ä': "a", 'Ö': "O", 'ö': "o", 'Ü': "U", 'ü': "u", 'ß': "ss", 'È': "E", 'è': "e",
	'Ё': "E", 'ё': "e", 'Є': "E", 'є': "e", 'Ї': "I", 'ї': "i", 'Љ': "Lj", 'љ': "lj", 'Њ': "Nj", 'њ': "nj",
	'Ћ': "C", 'ћ': "c", 'Ќ': "K", 'ќ': "k", 'Ў': "U", 'ў': "u", 'Џ': "Dz", 'џ': "dz", 'Ә': "A", 'ә': "a",
	'Ғ': "G", 'ғ': "g", 'Қ': "K", 'қ': "k", 'Ң': "N", 'ң': "n", 'Ұ': "U", 'ұ': "u", 'Ҳ': "H", 'ҳ': "h",
	'Җ': "Zh", 'җ': "zh", 'Ҹ': "Ch", 'ҹ': "ch", 'Ѡ': "O", 'ѡ': "o", 'Ѣ': "E", 'ѣ': "e", 'Ѥ': "E", 'ѥ': "e",
	'Ѧ': "A", 'ѧ': "a", 'Ѩ': "Ya", 'ѩ': "ya", 'Ѫ': "U", 'ѫ': "u", 'Ѭ': "Yu", 'ѭ': "yu", 'Ѯ': "Ks", 'ѯ': "ks",
	'Ѱ': "Ps", 'ѱ': "ps", 'Ѳ': "F", 'ѳ': "f", 'Ѵ': "V", 'ѵ': "v", 'Ѷ': "V", 'ѷ': "v", 'Ѹ': "U", 'ѹ': "u",
	'Ѻ': "O", 'ѻ': "o", 'Ѽ': "O", 'ѽ': "o", 'Ѿ': "O", 'ѿ': "o", 'Ҁ': "S", 'ҁ': "s", '҂': "S", '҃': "s",
	'҄': "N", '҅': "n", '҆': "T", '҇': "t", '҈': "Zh", '҉': "zh", 'Ҋ': "Ch", 'ҋ': "ch", 'Ҍ': "D", 'ҍ': "d",
	'Ҏ': "R", 'ҏ': "r", 'Ӏ': "I", 'Ӂ': "Zh", 'ӂ': "zh", 'Ӄ': "K", 'ӄ': "k", 'Ӆ': "L", 'ӆ': "l", 'Ӈ': "N",
	'ӈ': "n", 'Ӊ': "Ng", 'ӊ': "ng", 'Ӌ': "Ch", 'ӌ': "ch", 'Ӎ': "M", 'ӎ': "m", 'Ӑ': "A", 'ӑ': "a", 'Ӓ': "A",
	'ӓ': "a", 'Ӕ': "Ae", 'ӕ': "ae", 'Ӗ': "E", 'ӗ': "e", 'Ҕ': "G", 'ҟ': "k", 'Ҡ': "K", 'ҡ': "k", 'Ҥ': "N",
	'ҥ': "n", 'Ү': "U", 'ү': "u", 'Ҵ': "Ts", 'ҵ': "ts", 'Ҷ': "Ch", 'ҷ': "ch", 'Һ': "H", 'һ': "h", 'Ҽ': "Ts",
	'ҽ': "ts", 'Ҿ': "Ts", 'ҿ': "ts", 'ï': "i", 'А': "A", 'Е': "E", 'О': "O", 'С': "C", 'Н': "H",
	'₦': "N", '₽': "R", '\u202E': "", '\u202D': "", '\u200F': "", '\u200E': "", '\u200B': "", '\u2066': "",
	'\u2067': "", '\u2068': "", '\u2069': "", '\uFEFF': "", '\u2800': "", '\u2801': "", '\u0000': "",
	'\u0008': "", '\u0009': "", '\u000A': "", '\u000D': "", '\u001B': "", '\u007F': "", '\u0300': "",
	'\u0301': "", '\u034F': "", '\u036F': "", 'ë': "e", 'Ë': "E", 'Ï': "I", 'ÿ': "y", 'Ÿ': "Y", 'í': "i",
	'Í': "I", 'ó': "o", 'Ó': "O", 'ú': "u", 'Ú': "U", 'ý': "y", 'Ý': "Y", 'ì': "i", 'Ì': "I", 'ò': "o",
	'Ò': "O", 'ù': "u", 'Ù': "U", 'â': "a", 'Â': "A", 'ê': "e", 'Ê': "E", 'î': "i", 'Î': "I", 'ô': "o",
	'Ô': "O", 'û': "u", 'Û': "U", 'ã': "a", 'Ã': "A", 'õ': "o", 'Õ': "O", 'ø': "o", 'Ø': "O", 'œ': "oe",
	'Œ': "OE", 'æ': "ae", 'Æ': "AE", 'å': "a", 'Å': "A", 'þ': "th", 'Þ': "TH", 'ð': "d", 'Ð': "D",
	'µ': "u", '¿': "",
};

const invisibleCharsRegex = /[\u202E\u202D\u200F\u200E\u200B\u2066\u2067\u2068\u2069\uFEFF\u2800\u2801\u0000\u0008\u0009\u000A\u000D\u001B\u007F\u0300\u0301\u034F\u036F]/g;


const removeAccents = (str) => {
	if (!str) return '';
	str = str.replace(invisibleCharsRegex, '');
	return str
		.split('')
		.map(char => accentMapping[char] || char)
		.join('');
};

export { removeAccents };
